Data/SimulationFiles/E27_Re24115/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.015;

boundaryField
{
    inlet
    {
    	type cyclic;
        //type            turbulentIntensityKineticEnergyInlet;
		//intensity	0.1;
        //value           uniform 0.015;
    }
    outlet
    {
    	type cyclic;
        //type            zeroGradient;
    }
    fixedWalls-top
    {
    	type symmetry;
        //type            kqRWallFunction;
        //value           uniform 0.015;
    }
    fixedWalls-bottom
    {
        type            kqRWallFunction;
        value           uniform 0.015;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
